{
"list": [
	"rui", "npb", "bof", "nfb", "minor", "mb"
	],
"not_found": "embed -title \"Roll Item Helper\" -f \"Item not found|Specify a supported item name to roll the quantity and lookup the result on a table if required.\n\nuse `!rollitem list` to see a list of supported items.\" -color dd0000 -footer \"!rollitem [item name]\"",
"list_items": "embed -title \"Roll Item Helper\" -f \"Supported Items|{items}\" -color 0000dd -footer \"!rollitem [item name]\"",
"mb": {
	"name": "Moonblade",
	"type": "Weapon (longsword), legendary (DMG 217)",
	"url": "https://www.dndbeyond.com/magic-items/moonblade",
	"thumb": "https://media-waterdeep.cursecdn.com/avatars/thumbnails/19/250/315/315/636382373632199188.jpeg",
	"description": "Of all the magic items created by the elves, one of the most prized and jealously guarded is a moonblade. If the blade accepts you, you become attuned to it and a new rune appears on the blade. You remain attuned to the weapon until you die or the weapon is destroyed.\n\nA moonblade has one rune on its blade for each master it has served (typically 1d6 + 1).\n\nThe first rune always grants a +1 bonus to attack and damage rolls made with this magic weapon. Each rune beyond the first grants the moonblade an additional property.",
	"quantity_roll": "1d6+1",
	"quantity_units": "runes (including yours, after first +1 rune)",
	"roll": "d100",
	"lookup": [
		"40: Increase the bonus to attack and damage rolls by 1, to a maximum of +3. Reroll if the moonblade already has a +3 bonus.:2",
		"80: The moonblade gains a randomly determined minor property (see Special Features).::minor",
		"82: The moonblade gains the finesse property.",
		"84: The moonblade gains the thrown property (range 20/60 feet).",
		"86: The moonblade functions as a defender.",
		"90: The moonblade scores a critical hit on a roll of 19 or 20.",
		"92: When you hit with an attack using the moonblade, the attack deals an extra 1d6 slashing damage.",
		"94: When you hit a creature of a specific type (such as dragon, fiend, or undead) with the moonblade, the target takes an extra 1d6 damage of one of these types: acid, cold, fire, lightning, or thunder.",
		"96: You can use a bonus action to cause the moonblade to flash brightly. Each creature that can see you and is within 30 feet of you must succeed on a DC 15 Constitution saving throw or become blinded for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. This property can’t be used again until you take a short rest while attuned to the weapon.",
		"98: The moonblade functions as a ring of spell storing.",
		"99: You can use an action to call forth an elfshadow, provided that you don’t already have one serving you. The elfshadow appears in an unoccupied space within 120 feet of you. It uses the statistics for a shadow, except it is neutral, immune to effects that turn undead, and doesn’t create new shadows. You control this creature, deciding how it acts and moves. It remains until it drops to 0 hit points or you dismiss it as an action.",
		"100: The moonblade functions as a vorpal sword."
		]
	},
"nfb": {
	"name": "Necklace of Fireballs",
	"type": "Wondrous Item, rare (BR 182)",
	"url": "https://www.dndbeyond.com/magic-items/necklace-of-fireballs",
	"thumb": "https://media-waterdeep.cursecdn.com/avatars/thumbnails/18/902/315/315/636381755589424980.jpeg",
	"description": "This necklace has 1d6 + 3 beads hanging from it. You can use an action to detach a bead and throw it up to 60 feet away. When it reaches the end of its trajectory, the bead detonates as a 3rd-level fireball spell (save DC 15).\n\nYou can hurl multiple beads, or even the whole necklace, as one action. When you do so, increase the level of the fireball by 1 for each bead beyond the first.",
	"quantity_roll": "1d6+3",
	"quantity_units": "beads"
	},
"minor": {
	"name": "Minor Property",
	"type": "Special Feature (DMG)",
	"url": "https://www.dndbeyond.com/sources/dmg/treasure#SpecialFeatures",
	"roll": "d20",
	"lookup": [
		"1: Beacon. The bearer can use a bonus action to cause the item to shed bright light in a 10-foot radius and dim light for an additional 10 feet, or to extinguish the light.",
		"2: Compass. The wielder can use an action to learn which way is north.",
		"3: Conscientious. When the bearer of this item contemplates or undertakes a malevolent act, the item enhances pangs of conscience.",
		"4: Delver. While underground, the bearer of this item always knows the item's depth below the surface and the direction to the nearest staircase, ramp, or other path leading upward.",
		"5: Gleaming. This item never gets dirty.",
		"6: Guardian. The item whispers warnings to its bearer, granting a +2 bonus to initiative if the bearer isn't incapacitated.",
		"7: Harmonious. Attuning to this item takes only 1 minute.",
		"8: Hidden Message. A message is hidden somewhere on the item. It might be visible only at a certain time of the year, under the light of one phase of the moon, or in a specific location.",
		"9: Key. The item is used to unlock a container, chamber, vault, or other entryway.",
		"10: Language. The bearer can speak and understand a language of the DM's choice while the item is on the bearer's person.",
		"11: Sentinel. Choose a kind of creature that is an enemy of the item's creator. This item glows faintly when such creatures are within 120 feet of it.",
		"12: Song Craft. Whenever this item is struck or is used to strike a foe, its bearer hears a fragment of an ancient song.",
		"13: Strange Material. The item was created from a material that is bizarre given its purpose. Its durability is unaffected.",
		"14: Temperate. The bearer suffers no harm in temperatures as cold as -20 degrees Fahrenheit or as warm as 120 degrees Fahrenheit.",
		"15: Unbreakable. The item can't be broken. Special means must be used to destroy it.",
		"16: War Leader. The bearer can use an action to cause his or her voice to carry clearly for up to 300 feet until the end of the bearer's next turn.",
		"17: Waterborne. This item floats on water and other liquids. Its bearer has advantage on Strength (Athletics) checks to swim.",
		"18: Wicked. When the bearer is presented with an opportunity to act in a selfish or malevolent way, the item heightens the bearer's urge to do so.",
		"19: Illusion. The item is imbued with illusion magic, allowing its bearer to alter the item's appearance in minor ways. Such alterations don't change how the item is worn, carried, or wielded, and they have no effect on its other magical properties. For example, the wearer could make a red robe appear blue, or make a gold ring look like it's made of ivory. The item reverts to its true appearance when no one is carrying or wearing it.",
		"20: Roll twice, rerolling any additional 20s."	
		]
	},
"npb": {
	"name": "Necklace of Prayer Beads",
	"type": "Wondrous Item, rare (BR 182)",
	"thumb": "https://media-waterdeep.cursecdn.com/avatars/thumbnails/18/903/315/315/636381755691898979.jpeg",
	"url": "https://www.dndbeyond.com/magic-items/necklace-of-prayer-beads",
	"description": "This necklace has 1d4 + 2 magic beads made from aquamarine, black pearl, or topaz. It also has many nonmagical beads made from stones such as amber, bloodstone, citrine, coral, jade, pearl, or quartz. If a magic bead is removed from the necklace, that bead loses its magic.\n\nSix types of magic beads exist. The GM decides the type of each bead on the necklace or determines it randomly. A necklace can have more than one bead of the same type. To use one, you must be wearing the necklace. Each bead contains a spell that you can cast from it as a bonus action (using your spell save DC if a save is necessary). Once a magic bead's spell is cast, that bead can't be used again until the next dawn.",
	"quantity_roll": "1d4+2",
	"quantity_units": "magic beads",
	"roll": "d20",
	"lookup": [
		"6: Blessing - Bless spell",
		"12: Curing - Cure Wounds (2nd level) or Lesser Restoration spell",
		"16: Favor - Greater Restoration spell",
		"18: Smiting - Branding Smite spell",
		"19: Summons - Planar Ally spell",
		"20: Wind Walking - Wind Walk spell"
		]
	},
"rui":{
	"name": "Robe of Useful Items",
	"type": "Wondrous Item, uncommon (BR 195)",
	"thumb": "https://media-waterdeep.cursecdn.com/avatars/thumbnails/19/234/315/315/636382366300562305.jpeg",
	"url": "https://www.dndbeyond.com/magic-items/robe-of-useful-items",
	"description": "This robe has cloth patches of various shapes and colors covering it. While wearing the robe, you can use an action to detach one of the patches, causing it to become the object or creature it represents. Once the last patch is removed, the robe becomes an ordinary garment.\n\nThe robe has two of each of the following patches:\n\nDagger\nBullseye lantern (filled and lit)\nSteel mirror\n10-foot pole\nHempen rope (50 feet, coiled)\nSack\n\nIn addition, the robe has 4d4 other patches. The GM chooses the patches or determines them randomly.",
	"quantity_roll": "4d4",
	"quantity_units": "other patches",
	"roll": "d100",
	"lookup": [
		"8: Bag of 100 gp",
		"15: Silver coffer (1 foot long, 6 inches wide and deep) worth 500 gp",
		"22: Iron door (up to 10 feet wide and 10 feet high, barred on one side of your choice, magically fits opening)",
		"30: 10 gems worth 100 gp each",
		"44: Wooden ladder (24 feet long)",
		"51: A riding horse with saddle bags",
		"59: Pit (a cube 10 feet on a side), which you can place on the ground within 10 feet of you",
		"68: Potion of healing (4)",
		"75: Rowboat (12 feet long)",
		"83: Spell scroll containing one spell of 1st to 3rd level",
		"90: Mastiff (2)",
		"96: Window (2 feet by 4 feet, up to 2 feet deep), which you can place on a vertical surface you can reach",
		"100: Portable ram"
		]
	},
"bof":
	{
	  "name": "Bead of Force",
	  "type": "Wondrous item, rare (BR 154)",
	  "url": "https://www.dndbeyond.com/magic-items/bead-of-force",
	  "description": "This small black sphere measures 3/4 of an inch in diameter and weighs an ounce. Typically, 1d4 + 4 beads of force are found together.\nYou can use an action to throw the bead up to 60 feet. The bead explodes on impact and is destroyed. Each creature within a 10-foot radius of where the bead landed must succeed on a DC 15 Dexterity saving throw or take 5d4 force damage and be trapped.",
	  "quantity_roll": "1d4+4",
	  "quantity_units": "beads"
	}
}